// Найдите произведение пар чисел в одномерном массиве. 
// Парой считаем первый и послений элемент, второй и предпоследний и т.д.
Console.WriteLine("Hello, World!");
