// Пользователь вводит с клавиатуры М чисел. Посчитать сколько чисел больше 0 ввёл пользователь
Console.WriteLine("Hello, World!");
