// Напишите цикл, который принимает на вход два числа (A и B) 
// и возводит число A в натуральную степень B. Без модуля Math, используем цикл for.

Console.WriteLine("Введите два числа");
int Stepen (int a, int b)
{
    int c = 0;


}
