// Напишите прогрмму, которая на входпринимает число, выдаёь её квадрат

Console.WriteLine("Write number");
int num = int.Parse(Console.ReadLine());
Console.WriteLine(num * num);
