// напишите программу вычисления модуля числа
Console.WriteLine("DDtlbnt cnxkj");
int num = int.Parse(Console.ReadLine());

 