// Напишите программу, которая на вход принимает число и выдаёт, является ли число чётным.
Console.WriteLine("Write number 1");
int num = int.Parse(Console.ReadLine());

if (num % 2 == 0)
{
    Console.Write("да");
}

else 
    Console.Write("нет");

